[
  {
    "interface": "InterFace:Android's default user interface is mainly based on direct manipulation, using touch inputs that loosely correspond to real-world actions, like swiping, tapping, pinching, and reverse pinching to manipulate on-screen objects, along with a virtual keyboard.Game controllers and full-size physical keyboards are supported via Bluetooth or USB.The response to user input is designed to be immediate and provides a fluid touch interface, often using the vibration capabilities of the device to provide haptic feedback to the user. Internal hardware, such as accelerometers, gyroscopes and proximity sensors are used by some applications to respond to additional user actions, for example adjusting the screen from portrait to landscape depending on how the device is oriented,[84] or allowing the user to steer a vehicle in a racing game by rotating the device, simulating control of a steering wheel",
    "homeScreen": "Home Screen:Android devices boot to the home screen, the primary navigation and information hub on Android devices, analogous to the desktop found on personal computers. Android home screens are typically made up of app icons and widgets; app icons launch the associated app, whereas widgets display live, auto-updating content, such as a weather forecast, the user's email inbox, or a news ticker directly on the home screen.A home screen may be made up of several pages, between which the user can swipe back and forth.",
    "applications": "Applications ()apps), which extend the functionality of devices (and must be 64-bit) are written using the Android software development kit (SDK)and, often, Kotlin programming language, which replaced Java as Google's preferred language for Android app development in May 2019,Java is still supported (originally the only option for user-space programs, and is often mixed with Kotlin), as is C++.",
    "storage": "The storage of Android devices can be expanded using secondary devices such as SD cards. Android recognizes two types of secondary storage: portable storage (which is used by default), and adoptable storage. Portable storage is treated as an external storage device. Adoptable storage, introduced on Android 6.0, allows the internal storage of the device to be spanned with the SD card, treating it as an extension of the internal storage. This has the disadvantage of preventing the memory card from being used with another device unless it is reformatted."
  }
]