[
  {
    "hardware":"iPhone 14 and 14 Plus are available in three internal storage configurations: 128, 256, and 512 GB. It has 6 GB of RAM, an increase over the iPhone 13 and 13 mini model's 4 GB of RAM. The iPhone 14 and 14 Plus have the same IP68 rating for dust and water resistance as their predecessors.","chipset":"The iPhone 14 and iPhone 14 Plus are equipped with the Apple A15 Bionic system on a chip, the same variant used on the 2021 iPhone 13 Pro and 13 Pro Max.The iPhone 14 and 14 Plus feature a 6-core CPU, 5-core GPU, and 16-core Neural Engine.","display":"The iPhone 14 features a 6.1-inch (155 mm) display with Super Retina XDR OLED technology at a resolution of 2532 × 1170 pixels and a pixel density of about 460 PPI with a refresh rate of 60Hz. The iPhone 14 Plus features a 6.7-inch (170 mm) display with the same technology at a resolution of 2778 × 1284 pixels and a pixel density of about 458 PPI. Both models have typical brightness up to 800 nits, and max brightness up to 1200 nits.","camera":"The iPhone 14 and 14 Plus feature the same camera system with two cameras: one front-facing camera (12MP f/1.9), and two back-facing cameras: a wide (12MP f/1.5) and ultra-wide (12MP f/2.4) camera, with the wide and front-facing cameras having a faster aperture than the iPhone 13. The front facing camera also has autofocus for the first time.The cameras use Apple's latest computational photography engine, called Smart HDR 4. Users can also choose from a range of photographic styles during capture, including rich contrast, vibrant, warm, and cool. Apple clarifies this is different from a filter because it works intelligently with the image processing algorithm during capture to apply local adjustments to an image and the effects will be baked into the photos, unlike filters which can be removed after applying.The camera app contains Cinematic Mode, which allows users to rack focus between subjects and create (simulate) shallow depth of field using software algorithms. It is supported on wide and front-facing cameras in 4K at 30 fps.","battery":"The iPhone 14 provides 20 hours of video playback, while the Plus variant provides 26 hours of video playback."
  }
]