[
  {
    "chipsets":"The S22 line comprises three models with various hardware specifications. Except for some African and all European countries that utilize the Exynos 2200, all models outside these regions utilize the Qualcomm Snapdragon 8 Gen 1.","display":"The S22 series feature Dynamic AMOLED 2X,displays with HDR10+ support and dynamic tone mapping technology. All models utilize a second-generation ultrasonic in-screen fingerprint sensor.","Storage":"The S22 and S22+ offer 8 GB of RAM with 128 GB and 256 GB options for internal storage. The S22 Ultra has 8 GB of RAM with 128 GB as well as a 12 GB option with 256 GB, 512 GB and 1 TB options for internal storage. Unlike the S21 Ultra, the S22 Ultra doesn't feature a model with a 16 GB RAM variant. All three models lack a microSD card slot.","batteries":"The S22, S22+, and S22 Ultra contain non-removable 3,700 mAh, 4,500 mAh, and 5000 mAh Li-Po batteries respectively. The S22 supports wired charging over USB-C at up to 25W (using USB Power Delivery) while the S22+ and S22 Ultra have faster 45W charging. Tests found there's no significant difference between the 45W and 25W charging speeds.All three have Qi inductive charging up to 15W. The phones also have the ability to charge other Qi-compatible devices from the S22's own battery power, which is branded as Wireless PowerShare, at up to 4.5W.","connectivity":"All three phones support 5G SA/NSA networks. The Galaxy S22 supports Wi-Fi 6 and Bluetooth 5.2, while the Galaxy S22+ and S22 Ultra support Wi-Fi 6E and Bluetooth 5.2. The S22+ and S22 Ultra models also support Ultra Wideband (UWB) for short-range communications similar to NFC (not to be confused with 5G mmWave, which is marketed as Ultra Wideband by Verizon). Samsung uses this technology for their new SmartThings Find feature and the Samsung Galaxy SmartTag+.","s_pen":"The S22 Ultra is the first S series phone to include a built-in S Pen, a hallmark feature of the Galaxy Note series. The S Pen has latency at 2.8ms, reduced from 26ms on Note 20 and 9ms on the Note 20 Ultra and S21 Ultra (note that the S21 Ultra had S Pen functionality, but was not included with the phone), and marked the introduction of an 'AI-based co-ordination prediction system'. The S Pen also supports Air gestures and the Air Action system."
  }
]